cf_billing/InformationRegisters/энргНастройкаДиапазоновДифференцированногоТарифа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкаДиапазоновДифференцированногоТарифа</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>От</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>До</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Диапазон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДиапазоныДифференцированныхТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкаДиапазоновДифференцированногоТарифа/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

// Заполняет актуальные данные срез последних.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция АктуальныеДанныеСрезПоследних(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеДанныеСрезПоследних());
	Пакет.ТаблицаДляПомещения 	= "НастройкаДиапазоновДифференцированногоТарифаНачало";
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	Параметры 					= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод = Параметры[0];
		ПараметрПериод.Выражение = Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		
		ДоступныеПараметры = "Организация, Район, Услуга, ВидБлагоустройства, Диапазон";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(
			Параметры[1],
			ПараметрыОтбора.ПараметрыВТ,
			ДоступныеПараметры);	
				
	КонецЕсли;	 	
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеДанныеСрезПоследнихИтог());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса актуальные данные срез последних.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаАктуальныеДанныеСрезПоследних() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСрезПоследних.Организация КАК Организация,
	|	ТаблицаСрезПоследних.Район КАК Район,
	|	ТаблицаСрезПоследних.Услуга КАК Услуга,
	|	ТаблицаСрезПоследних.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ТаблицаСрезПоследних.Диапазон КАК Диапазон,
	|	ТаблицаСрезПоследних.Диапазон.Приоритет КАК ПриоритетДиапазона,
	|	ТаблицаСрезПоследних.От КАК От,
	|	ТаблицаСрезПоследних.До КАК До,
	|	ТаблицаСрезПоследних.До - ТаблицаСрезПоследних.От КАК Разница
	|ИЗ
	|	РегистрСведений.энргНастройкаДиапазоновДифференцированногоТарифа.СрезПоследних КАК ТаблицаСрезПоследних";
		
	Возврат Текст;
	
КонецФункции

// Получает текст запроса актуальные данные срез последних итог.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаАктуальныеДанныеСрезПоследнихИтог() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.Организация КАК Организация,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.Район КАК Район,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.Услуга КАК Услуга,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.ВидБлагоустройства КАК ВидБлагоустройства,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.Диапазон КАК Диапазон,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.ПриоритетДиапазона КАК ПриоритетДиапазона,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.От КАК От,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.До КАК До,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.Разница КАК Разница,
	|	СУММА(НастройкаДиапазоновДифференцированногоТарифаНачалоПраво.Разница) КАК СуммарныйОбъемПредыдущихДиапазоновВключаяТекущий
	|ИЗ
	|	НастройкаДиапазоновДифференцированногоТарифаНачало КАК НастройкаДиапазоновДифференцированногоТарифаНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкаДиапазоновДифференцированногоТарифаНачало КАК НастройкаДиапазоновДифференцированногоТарифаНачалоПраво
	|		ПО НастройкаДиапазоновДифференцированногоТарифаНачало.Организация = НастройкаДиапазоновДифференцированногоТарифаНачалоПраво.Организация
	|			И НастройкаДиапазоновДифференцированногоТарифаНачало.Район = НастройкаДиапазоновДифференцированногоТарифаНачалоПраво.Район
	|			И НастройкаДиапазоновДифференцированногоТарифаНачало.Услуга = НастройкаДиапазоновДифференцированногоТарифаНачалоПраво.Услуга
	|			И НастройкаДиапазоновДифференцированногоТарифаНачало.ВидБлагоустройства = НастройкаДиапазоновДифференцированногоТарифаНачалоПраво.ВидБлагоустройства
	|			И НастройкаДиапазоновДифференцированногоТарифаНачало.ПриоритетДиапазона >= НастройкаДиапазоновДифференцированногоТарифаНачалоПраво.ПриоритетДиапазона
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.Организация,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.ВидБлагоустройства,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.Услуга,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.Район,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.Диапазон,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.ПриоритетДиапазона,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.От,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.До,
	|	НастройкаДиапазоновДифференцированногоТарифаНачало.Разница";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
